name: "VGG_ILSVRC_16_layers"
input: "conv3_3"
input_shape {
  dim: 1
  dim: 256
  dim: 30
  dim: 30
}
input: "conv4_3"
input_shape {
  dim: 1
  dim: 512
  dim: 30
  dim: 30
}
input: "conv5_3"
input_shape {
  dim: 1
  dim: 512
  dim: 30
  dim: 30
}
input: "rois"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}
layer {
  name: "roi_pool3"
  type: "ROIPooling"
  bottom: "conv3_3"
  bottom: "rois"
  top: "roi_pool3"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.25 # 1/4
  }
}
layer {
  name: "roi_pool4"
  type: "ROIPooling"
  bottom: "conv4_3"
  bottom: "rois"
  top: "roi_pool4"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.125 # 1/8
  }
}
layer {
  name: "roi_pool5"
  type: "ROIPooling"
  bottom: "conv5_3"
  bottom: "rois"
  top: "roi_pool5"
  roi_pooling_param {
    pooled_w: 7
    pooled_h: 7
    spatial_scale: 0.0625 # 1/16
  }
}
layer {
  name: "int6_1"
  type: "InnerProduct"
  bottom: "roi_pool3"
  top: "int6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_1"
  type: "ReLU"
  bottom: "int6_1"
  top: "int6_1"
}
layer {
  name: "drop6_1"
  type: "Dropout"
  bottom: "int6_1"
  top: "int6_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "int6_2"
  type: "InnerProduct"
  bottom: "roi_pool4"
  top: "int6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_2"
  type: "ReLU"
  bottom: "int6_2"
  top: "int6_2"
}
layer {
  name: "drop6_2"
  type: "Dropout"
  bottom: "int6_2"
  top: "int6_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "int6_3"
  type: "InnerProduct"
  bottom: "roi_pool5"
  top: "int6_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu6_3"
  type: "ReLU"
  bottom: "int6_3"
  top: "int6_3"
}
layer {
  name: "drop6_3"
  type: "Dropout"
  bottom: "int6_3"
  top: "int6_3"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "concat6"
  type: "Concat"
  bottom: "int6_1" 
  bottom: "int6_2"
  bottom: "int6_3"
  top: "int6"
  concat_param {
    axis: 1 # along channels
  }
}
layer {
  name: "int7_1"
  type: "InnerProduct"
  bottom: "int6"
  top: "int7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.0001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_1"
  type: "ReLU"
  bottom: "int7_1"
  top: "int7_1"
}
layer {
  name: "drop7_1"
  type: "Dropout"
  bottom: "int7_1"
  top: "int7_1"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "int7_2"
  type: "InnerProduct"
  bottom: "int6"
  top: "int7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 256
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7_2"
  type: "ReLU"
  bottom: "int7_2"
  top: "int7_2"
}
layer {
  name: "drop7_2"
  type: "Dropout"
  bottom: "int7_2"
  top: "int7_2"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "adj_score"
  type: "InnerProduct"
  bottom: "int7_1"
  top: "adj_score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 11
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "adj_bbox"
  type: "InnerProduct"
  bottom: "int7_1"
  top: "adj_bbox"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 44
    weight_filler {
      type: "gaussian"
      std: 0.001
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "zoom_score"
  type: "InnerProduct"
  bottom: "int7_2"
  top: "zoom_score"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "adj_prob"
  type: "Sigmoid"
  bottom: "adj_score"
  top: "adj_prob"
}
layer {
  name: "zoom_prob"
  type: "Sigmoid"
  bottom: "zoom_score"
  top: "zoom_prob"
}
